---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceComponentTrimType
source: html/335d58db-ab01-225b-9799-3958c20822d4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceComponentTrimType Property

"Component Trim"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceComponentTrimType { get; }
```